Remya1562/stm32-freertos-environment-monitor/Core/Src/main.c

#include "stm32f4xx.h"
#include <stdio.h>
#include <stdint.h>

#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

#include "usart2.h"
#include "gpio.h"
#include "bme280.h"
#include "adc.h"
#include "i2c.h"
#include"timer.h"

SemaphoreHandle_t xButtonSemaphore;

typedef enum{
		live_streaming,
		threshold_adjust
	}SystemMode;

volatile SystemMode current_mode = live_streaming;
volatile float tempThreshold = 40.0f;
volatile float current_temp = 25.0f;

void update_rgb_color(float temp, float threshold) {
    if (current_mode == live_streaming) {
        if (temp < 18.0f)
            set_rgb(1000, 1000, 0);   // Blue
        else if (temp <= threshold)
            set_rgb(1000, 0, 1000);   // Green
        else
            set_rgb(0, 1000, 1000);   // Red
    }
    else {
    }
}



void vTaskRGBLed(void *pvParameters) {
    while(1) {
        update_rgb_color(current_temp, tempThreshold);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

void vTaskLiveStreaming(void *pvParameters){
	while(1){
		if(current_mode==live_streaming){
			SensorData d=bme280_read();
			current_temp = d.temperature;
			printf("Temp = %.2f C, Hum = %.2f %%, Threshold = %.2f°C\r\n",d.temperature, d.humidity, tempThreshold);
			vTaskDelay(pdMS_TO_TICKS(1000));
		}
		else if(current_mode == threshold_adjust) {
			 uint32_t adc_val = adc1_read();
		     tempThreshold = 25.0f + ((float)adc_val / 4095.0f) * 20.0f;
		     printf("Adjusting threshold: %.2f°C\r\n", tempThreshold);
		     vTaskDelay(pdMS_TO_TICKS(500));
		}
	}
}


void vTaskModeManager(void *pvParameters){
    while (1){
		if(xSemaphoreTake(xButtonSemaphore,portMAX_DELAY)==pdTRUE){
			if (current_mode == live_streaming) {
			    current_mode = threshold_adjust;
			    printf("Mode switched:THRESHOLD_ADJUST\r\n");
			}
			else{
				current_mode = live_streaming;
				printf("Mode switched: LIVE_STREAMING\r\n");
			}
		}

	}
}

int main(void){
	uart_tx_init();
	i2c1_init();
	bme280_init();
	adc1_init();
	button_exti_init();
	tim2_debounce_init();
	timer_init();

	printf("System Initialized\r\n");

    xButtonSemaphore = xSemaphoreCreateBinary();
    printf("Semaphore created: %p\n", xButtonSemaphore);
    if (xButtonSemaphore == NULL) {
           printf("Failed to create button semaphore!\r\n");
           while(1);
       }

    xTaskCreate(vTaskLiveStreaming,"LiveStream",512,NULL,1,NULL);
    xTaskCreate(vTaskModeManager,"ModeManager",256,NULL,2,NULL);
    xTaskCreate(vTaskRGBLed,"RGBControl",256,NULL,1,NULL);

    NVIC_SetPriority(EXTI1_IRQn, 5);
    NVIC_SetPriority(TIM2_IRQn, 5);

    NVIC_EnableIRQ(EXTI1_IRQn);
    NVIC_EnableIRQ(TIM2_IRQn);

    vTaskStartScheduler();

    while (1);

}
void EXTI1_IRQHandler(void) {
    if(EXTI->PR & (1U << 1)) {
        EXTI->PR |= (1U << 1);
        EXTI->IMR &= ~(1U << 1);
        TIM2->SR &= ~(1U << 0);
        TIM2->CNT = 0;
        TIM2->CR1 |= (1U << 0);
    }
}
void TIM2_IRQHandler(void) {
    if(TIM2->SR & 1) {
        TIM2->SR &= ~1;
        TIM2->CR1 &= ~(1U << 0);
        if(GPIOA->IDR & (1U << 1)) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            xSemaphoreGiveFromISR(xButtonSemaphore, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }

        EXTI->IMR |= (1U << 1);
    }
}
